---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
source: html/43edeae1-3d01-5cd7-9889-21bc6275b293.htm
---
# StructuralSectionRectangleParameterized Properties

Common set of parameters for structural analysis.